packages/helpers/woc-api/test/perf_test/arc_get_status.yml
execution:
- executor: locust
  throughput: 100
  hold-for: 2s
  scenario: get-requests

scenarios:
  get-requests:
    timeout: 5
    requests:
      - url: https://api.taal.com/arc/v1/tx/ec375fac70427652cf31e85318c2cbf6a0c8885322e6bb4e22966916f99d627a
        method: GET
        headers:
          Accept: "Content-Type: application/json"
          Authorization: mainnet_2975d2afeb0b46f9e249f035949e700a
reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    cmdline: