packages/helpers/woc-api/test/perf_test/woc_get_1000rps.yml
scenarios:
  ########## USER 1 ##########
  get-requests: #check setting here https://gettaurus.org/docs/locust/#Data-sources
    timeout: 5s
    # these are data-sources options for locust. See more info below.
    data-sources:
      - path: woc_api_variables_1000rps.csv
        delimiter: ";"
        quoted: false
        loop: true
        variable-names: apiKey
        random-order: false
    headers:
      Accept: "Content-Type: application/json"
      Authorization: ${apiKey}
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/woc
        label: "AWS - GET /v1/bsv/test/woc"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/chain/info
        label: "AWS - GET /v1/bsv/test/chain/info"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/circulatingsupply
        label: "AWS - GET /v1/bsv/test/circulatingsupply"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/chain/tips
        label: "AWS - GET /v1/bsv/test/tips"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/block/headers
        label: "AWS - GET /v1/bsv/test/headers"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/tx/1a566537c4b07f6af2561fd1f0f70517d21cd79ca0271b66f8b98ea9bcca07cd/hex
        label: "AWS - GET /v1/bsv/test/tx/1a566537c4b07f6af2561fd1f0f70517d21cd79ca0271b66f8b98ea9bcca07cd/hex"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/tx/1a566537c4b07f6af2561fd1f0f70517d21cd79ca0271b66f8b98ea9bcca07cd/out/0/hex
        label: "AWS - GET /v1/bsv/test/tx/1a566537c4b07f6af2561fd1f0f70517d21cd79ca0271b66f8b98ea9bcca07cd/out/0/hex"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/tx/1a566537c4b07f6af2561fd1f0f70517d21cd79ca0271b66f8b98ea9bcca07cd/proof
        label: "AWS - GET /v1/bsv/test/tx/1a566537c4b07f6af2561fd1f0f70517d21cd79ca0271b66f8b98ea9bcca07cd/proof"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/mempool/info
        label: "AWS - GET /v1/bsv/test/mempool/info"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/mempool/raw
        label: "AWS - GET /v1/bsv/test/mempool/raw"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/info
        label: "AWS - GET /v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/info"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/balance
        label: "AWS - GET /v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/balance"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/history
        label: "AWS - GET /v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/history"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/unspent
        label: "AWS - GET /v1/bsv/test/address/mrootXaUeKMi6QzBKjRmBmwqPa9o3LJWF1/unspent"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/script/995ea8d0f752f41cdd99bb9d54cb004709e04c7dc4088bcbbbb9ea5c390a43c3/history
        label: "AWS - GET /v1/bsv/test/script/995ea8d0f752f41cdd99bb9d54cb004709e04c7dc4088bcbbbb9ea5c390a43c3/history"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/script/995ea8d0f752f41cdd99bb9d54cb004709e04c7dc4088bcbbbb9ea5c390a43c3/unspent
        label: "AWS - GET /v1/bsv/test/script/995ea8d0f752f41cdd99bb9d54cb004709e04c7dc4088bcbbbb9ea5c390a43c3/unspent"
      - url: https://api-ovh.whatsonchain.com/v1/bsv/test/exchangerate
        label: "AWS - GET /v1/bsv/test/exchangerate"

execution:
  - scenario: get-requests
    concurrency: 200
    hold-for: 2m
    ramp-up: 10s
    iterations: 10000
    throughput: 2000

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  local:
    capacity: 20
  locust:
    cmdline: --loglevel DEBUG