packages/helpers/woc-api/test/perf_test/woc_get_block_stats_by_height_1000rps_singleEndpoint.yml
execution:
  - executor: locust
    concurrency: 1000  # Number of users
    hold-for: 1m  # Duration of the test
    ramp-up: 30s  # Time to reach full load
    scenario: get-block-stats

scenarios:
  get-block-stats:
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/main/block/height/698730/stats
        method: GET
        headers:
          Accept: "application/json"

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    cmdline: