packages/helpers/woc-api/test/perf_test/woc_get_miner_minimum_fee_rates_stats_1000rps_singleEndpoint.yml
execution:
  - executor: locust
    concurrency: 1000  # Number of users
    hold-for: 1m  # Duration of the test
    ramp-up: 30s  # Time to reach full load
    scenario: get-miner-fees

scenarios:
  get-miner-fees:
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/main/miner/fees?from=1714608000&to=1714653060
        method: GET
        headers:
          Accept: "application/json"

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    cmdline: